function TM() {
	// 通过 load 函数加载的程序
	let cnt = 0;
	let description = undefined;
	let head = undefined;
	let border = undefined;
	let tail = undefined;
	let rules = undefined;

	// 运行时的一些状态，
	// index表示下标，qn表示状态对象，
	// string表示当前语言，before表示qn的字符串形式
	let index = undefined;
	let qn = undefined;
	let string = undefined;
	let before = undefined;

	// info表示提示信息
	// prepared表示图灵机对象是否准备就绪
	this.info = undefined;
	this.prepared = false;

	// 根据参数初始化图灵机对象
	this.load = (c, d, h, b, t, r)=>{
		cnt = c;
		description = d;
		head = h;
		border = b;
		tail = t;
		rules = r;
		this.reset();
	}

	// 获取待识别的语言
	this.input = (str)=>{
		splitStr = str.split(':');
		if (splitStr.length != cnt) {
			return false;
		}
		string = new Array();
		for (let i=0; i<splitStr.length; i++) {
			string.push([border, ...splitStr[i].split(''), border]);
		}
		return true;
	}

	// 执行一次
	this.step = ()=>{
		let accept = [];
		for (let i=0; i<string.length; i++) {
			accept.push(string[i][index[i]]);
		}
		accept = accept.join(',');
		let next = qn[accept];
		if (next===undefined) {
			return false;
		}

		this.info = `δ(${before}, (${accept}))=(${next[2]}, (${next[0]}), (${next[1]}))`;
		// this.info = `状态${before} 接受${accept} 将其变成${next[0]} 向${next[1]}走 状态变为${next[2]}`;
		before = next[2];

		nextQ = next[0].split(',');
		nextD = next[1].split(',');
		for (let i=0; i<string.length; i++) {
			string[i][index[i]] = nextQ[i];

			if (nextD[i]==='R') ++index[i];
			else if (nextD[i]==='L') --index[i];

			if (string[i][0]!==border) string[i].unshift(border);
			if (string[i][string[i].length-1]!==border) string[i].push(border);
		}
		qn = rules[next[2]];

		return true;
	}

	// 是否遇到一个结束状态
	this.end = ()=>{
		return tail.includes(before);
	}

	// 初始化运行时状态
	this.reset = ()=>{
		index = [1,1,1];
		qn = rules[head];
		string = undefined;
		before = head;
	}

	// 返回当前识别串的内容
	this.output = ()=>{
		return string;
	}

	// 返回当前下标
	this.getIndex = ()=>{
		return index;
	}

	this.getCnt = ()=>{
		return cnt;
	}
}
// 实例程序
let examples = {
	"课件 例4-1": "{\"cnt\":1,\"des\":\"这是一个识别0^n1^n的图灵机，n>=1\",\"head\":\"q0\",\"border\":\"B\",\"tail\":[\"q5\"],\"rules\":{\"q0\":{\"0\":[\"x\",\"R\",\"q1\"],\"y\":[\"y\",\"R\",\"q3\"]},\"q1\":{\"0\":[\"0\",\"R\",\"q1\"],\"1\":[\"y\",\"L\",\"q2\"],\"y\":[\"y\",\"R\",\"q1\"]},\"q2\":{\"0\":[\"0\",\"L\",\"q2\"],\"y\":[\"y\",\"L\",\"q2\"],\"x\":[\"x\",\"R\",\"q0\"]},\"q3\":{\"y\":[\"y\",\"R\",\"q3\"],\"B\":[\"B\",\"L\",\"q4\"]},\"q4\":{\"x\":[\"0\",\"L\",\"q4\"],\"y\":[\"1\",\"L\",\"q4\"],\"B\":[\"B\",\"R\",\"q5\"]}}}",
	"课件 例4-2": "{\"cnt\":1,\"des\":\"用来识别wcw，w={a,b}^+\",\"border\":\"B\",\"head\":\"q0\",\"tail\":[\"q8\"],\"rules\":{\"q0\":{\"a\":[\"X\",\"R\",\"q1a\"],\"b\":[\"Y\",\"R\",\"q1b\"]},\"q1a\":{\"a\":[\"a\",\"R\",\"q1a\"],\"b\":[\"b\",\"R\",\"q1a\"],\"c\":[\"c\",\"R\",\"q2a\"]},\"q2a\":{\"X\":[\"X\",\"R\",\"q2a\"],\"Y\":[\"Y\",\"R\",\"q2a\"],\"a\":[\"X\",\"L\",\"q3\"]},\"q1b\":{\"a\":[\"a\",\"R\",\"q1b\"],\"b\":[\"b\",\"R\",\"q1b\"],\"c\":[\"c\",\"R\",\"q2b\"]},\"q2b\":{\"X\":[\"X\",\"R\",\"q2b\"],\"Y\":[\"Y\",\"R\",\"q2b\"],\"b\":[\"Y\",\"L\",\"q3\"]},\"q3\":{\"X\":[\"X\",\"L\",\"q3\"],\"Y\":[\"Y\",\"L\",\"q3\"],\"c\":[\"c\",\"L\",\"q4\"]},\"q4\":{\"a\":[\"a\",\"L\",\"q5\"],\"b\":[\"b\",\"L\",\"q5\"],\"X\":[\"X\",\"R\",\"q6\"],\"Y\":[\"Y\",\"R\",\"q6\"]},\"q5\":{\"a\":[\"a\",\"L\",\"q5\"],\"b\":[\"b\",\"L\",\"q5\"],\"X\":[\"X\",\"R\",\"q0\"],\"Y\":[\"Y\",\"R\",\"q0\"]},\"q6\":{\"X\":[\"X\",\"R\",\"q6\"],\"Y\":[\"Y\",\"R\",\"q6\"],\"c\":[\"c\",\"R\",\"q6\"],\"B\":[\"B\",\"L\",\"q7\"]},\"q7\":{\"c\":[\"c\",\"L\",\"q7\"],\"X\":[\"a\",\"L\",\"q7\"],\"Y\":[\"b\",\"L\",\"q7\"],\"B\":[\"B\",\"R\",\"q8\"]}}}",
	"课件 例4-3": "{\"cnt\":1,\"des\":\"接受n个a，输出log2n个b\",\"border\":\"B\",\"head\":\"q0\",\"tail\":[\"q5\"],\"rules\":{\"q0\":{\"c\":[\"c\",\"R\",\"q0\"],\"a\":[\"c\",\"R\",\"q1\"],\"b\":[\"B\",\"L\",\"q4\"]},\"q1\":{\"c\":[\"c\",\"R\",\"q1\"],\"b\":[\"b\",\"R\",\"q1\"],\"B\":[\"b\",\"L\",\"q3\"],\"a\":[\"a\",\"R\",\"q2\"]},\"q2\":{\"c\":[\"c\",\"R\",\"q2\"],\"b\":[\"b\",\"R\",\"q2\"],\"B\":[\"b\",\"L\",\"q3\"],\"a\":[\"c\",\"R\",\"q1\"]},\"q3\":{\"b\":[\"b\",\"L\",\"q3\"],\"c\":[\"c\",\"L\",\"q3\"],\"a\":[\"a\",\"L\",\"q3\"],\"B\":[\"B\",\"R\",\"q0\"]},\"q4\":{\"b\":[\"B\",\"L\",\"q4\"],\"c\":[\"B\",\"L\",\"q4\"],\"B\":[\"B\",\"R\",\"q5\"]}}}",
	"课件 例4-4": "{\"cnt\":1,\"des\":\"输入0^m10^n当m>n时输出m-n个0\",\"border\":\"B\",\"head\":\"q0\",\"tail\":[\"q6\"],\"rules\":{\"q0\":{\"0\":[\"B\",\"R\",\"q1\"],\"1\":[\"B\",\"R\",\"q5\"]},\"q1\":{\"0\":[\"0\",\"R\",\"q1\"],\"1\":[\"1\",\"R\",\"q2\"]},\"q2\":{\"0\":[\"1\",\"L\",\"q4\"],\"1\":[\"1\",\"R\",\"q2\"],\"B\":[\"B\",\"L\",\"q3\"]},\"q3\":{\"0\":[\"0\",\"L\",\"q3\"],\"1\":[\"B\",\"L\",\"q3\"],\"B\":[\"0\",\"S\",\"q6\"]},\"q4\":{\"0\":[\"0\",\"L\",\"q4\"],\"1\":[\"1\",\"L\",\"q4\"],\"B\":[\"B\",\"R\",\"q0\"]},\"q5\":{\"0\":[\"B\",\"R\",\"q5\"],\"1\":[\"B\",\"R\",\"q5\"],\"B\":[\"B\",\"S\",\"q6\"]}}}",
	"课件 例4-5": "{\"cnt\":1,\"des\":\"输入n个a，输出n的二进制表示\",\"border\":\"B\",\"head\":\"q0\",\"tail\":[\"q7\"],\"rules\":{\"q0\":{\"0\":[\"0\",\"L\",\"q5\"],\"1\":[\"1\",\"L\",\"q5\"],\"c\":[\"c\",\"R\",\"q0\"],\"a\":[\"c\",\"R\",\"q1\"]},\"q1\":{\"0\":[\"0\",\"S\",\"q31\"],\"1\":[\"1\",\"S\",\"q31\"],\"c\":[\"c\",\"R\",\"q1\"],\"a\":[\"a\",\"R\",\"q2\"],\"B\":[\"B\",\"S\",\"q31\"]},\"q2\":{\"0\":[\"0\",\"S\",\"q30\"],\"1\":[\"1\",\"S\",\"q30\"],\"c\":[\"c\",\"R\",\"q2\"],\"a\":[\"c\",\"R\",\"q1\"],\"B\":[\"B\",\"S\",\"q30\"]},\"q30\":{\"0\":[\"0\",\"R\",\"q30\"],\"1\":[\"0\",\"R\",\"q31\"],\"B\":[\"0\",\"L\",\"q4\"]},\"q31\":{\"0\":[\"1\",\"R\",\"q30\"],\"1\":[\"1\",\"R\",\"q31\"],\"B\":[\"1\",\"L\",\"q4\"]},\"q4\":{\"0\":[\"0\",\"L\",\"q4\"],\"1\":[\"1\",\"L\",\"q4\"],\"a\":[\"a\",\"L\",\"q4\"],\"c\":[\"c\",\"L\",\"q4\"],\"B\":[\"B\",\"R\",\"q0\"]},\"q5\":{\"c\":[\"c\",\"L\",\"q5\"],\"B\":[\"B\",\"R\",\"q6\"]},\"q6\":{\"0\":[\"0\",\"S\",\"q7\"],\"1\":[\"1\",\"S\",\"q7\"],\"c\":[\"B\",\"R\",\"q6\"]}}}"
}

// 通过 json 解析后会得到类似如下的对象，该对象为例4-1
// let t = {
// 	des: "这是一个识别0^n1^n的图灵机，n>=1",
// 	head: "q0",
// 	border: "B",
// 	tail: ["q5"],
// 	rules: {
// 		q0: {
// 			0: ['x', 'R', 'q1'],
// 			y: ['y', 'R', 'q3'],
// 		},
// 		q1: {
// 			y: ['y', 'R', 'q1'],
// 			0: ['0', 'R', 'q1'],
// 			1: ['y', 'L', 'q2'],
// 		},
// 		q2: {
// 			y: ['y', 'L', 'q2'],
// 			0: ['0', 'L', 'q2'],
// 			x: ['x', 'R', 'q0'],
// 		},
// 		q3: {
// 			y: ['y', 'R', 'q3'],
// 			B: ['B', 'L', 'q4'],
// 		},
// 		q4: {
// 			x: ['0', 'L', 'q4'],
// 			y: ['1', 'L', 'q4'],
// 			B: ['B', 'R', 'q5']
// 		}
// 	}
// }